{
  "table-of-contents": {
    "title": "Tabla de contenidos"
  },
  "who-am-i": {
    "title": "Quién soy",
    "intro-content": "<p><b>adversegecko3@Eric-PC</b>:~$ whoami<br />Eric Barrero Giménez<br />AdverseGecko3</p>",
    "next-content": "<p>Hola, soy Eric Barrero Giménez, y soy Desarrollador de Software. He estado estudiando Desarrollo de Software durante 2 años en <i>Centre d'Estudis Monlau</i>, y actualmente estoy trabajando en Deloitte como Junior Delivery Analyst.<br /><br />He aprendido java durante 2 años:</p><ul><li>En el primer año estdié java puro incluyendo las temás más básicos como los tipos de variables, bucles, estructura de datos, Ventanas gráficas (Swing), etc.<br />Más en <a href=\"#1DAM\"><b><i>1 DAM</i></b></a>.</li><br /><li>En el segundo año, hablando de Java, estudié más Ventanas gráfcias (Swing), <i>Sockets</i>, Ingenieria inversa, <i>DAOs</i>.<br />Si hablamos sobre Android, este fue mi primer año. Empecé aprendiendo lo básico como crear Actividades, entendiendo las vistas básicas e implementando todo el conocimiento de Java del último año, y más tarde, también aprendí el ciclo de vida de las actividades y Fragments, Hilos, SQLite, etc. Luego empecé a crear pequeñas apps \"jugando\" con los sensores (proximidad, geolocalización, brújula, etc.); Un reproductor de música, photos y vídeos; o una app con administración y manipulación de una base de datos local interna.<br />Más en <a href=\"#2DAM\"><b><i>2 DAM</i></b></a>.</li></ul><p>En el siguiente año estudié ASIX (Administración de redes y sistemas):</p><ul><li>Este año aprendí en gran parte administración de Bases de datos, Redes y Sistemas Operativos. También aprendí a utilizar las herramientas y programas necesarios para configurar las redes o solucionar los problemas de los sistemas.<br />Más en <a href=\"#2ASIX\"><b><i>2 ASIX</i></b></a>.</li></ul>"
  },
  "academic-timeline": {
    "title": "Trayectoria académica",
    "first-title": "Bachillerato",
    "first-dates": "Septiembre 2016 - Junio 2018",
    "first-content": "<p>Despues de 4 buenos años en la ESO con una nota media de 7 / 8, mis profesores me recomendaron ir a Bachillerato en vez de CFGM (Ciclo Formativo de Grado Medio).<br/><br/>Durante estos 2 años estudié la rama tecnológica, incluyendo las asignaturas optativas Tecnología, Física y Química.<br/><br/>Mi nota final fue de ~6.5, pero estaba convencido de que lo mio era hacer algo práctico antes que algo teórico.",
    "second-title": "CFGS - 1º Desarrollo de Aplicaciones Multiplataforma",
    "second-dates": "Septiembre 2018 - Junio 2019",
    "second-content": "<p>Después de acabar Bachillerato empecé 1º DAM, ya que programar es algo que siempre me llamaba la atención. El primer año fue una mezcla entré desarrollo de software y administración de redes y sistemas.<br/><br/>Durante este año estudié: </p> <ul> <li>Administración de Windows Cliente, Windows Server, Linux Cliente y Linux Server.</li> <li>Java.</li> <li>C++.</li> <li>SQL.</li> <li>PL-SQL.</li> <li>XML.</li> <li>HTML.</li> <li>CSS.</li> <li>XSL.</li> </ul> <p>Mi nota final fue <b>~8.5</b>.</p>",
    "third-title": "CFGS - 2º Desarrollo de Aplicaciones Multiplataforma",
    "third-dates": "Septiembre 2019 - Junio 2020",
    "third-content": "<p>Este segundo y último año de DAM era 100% desarrollo de software. Durante este año estudié: </p> <ul> <li>Android<ul> <li>Lenguaje: Java</li> <li>Implementación de vistas</li> <li>Activities</li> <li>Fragments</li> <li>Intents (a otros Activities y a otras apps)</li> <li>Threads</li> <li>BBDD interna (SQLite)</li> <li>LifeCycle</li> <li>Logcat</li> <li>MediaPlayer</li> <li>GraphicView</li> <li>Sensores (Proximidad, GPS, Giroscopio)</li> <li>Escáner QR</li> <li>Comunicación con APIs y Web Services (recibir datos y enviar datos)</li> </ul> </li> <li>Java (Estructura de datos, Sockets, Ingeniería inversa).</li> <li>C#.</li> <li>PHP.</li> </ul> <p>Como este era el último año de DAM, teníamos que hacer un proyecto de final de curso. Estabamos preparados para empezar a trabajar junto con hospitales para hacer el proyecto sobre Alzheimer y/o Parkinson, pero a causa del COVID-19 no pudimos empezar. Así que decidimos hacer una infraestructura de software para administrar un restaurante de pequeña o mediana escala. Contenía:</p> <ul> <li>Una base de datos almacenada en Amazon AWS (Amazon RDS).</li> <li>Una página web hecha en HTML, CSS, JavaScript y PHP para reservar mesa y comunicar con la BBDD y las apps mediante JSON.</li> <li>Una aplicación de escritorio hecha con C# para administrar los usuarios y administradores, los platos y menús disponibles, y una sección dedicada para que los cocineros sepan los platos qeu tienen que cocinar.</li> <li>Una aplicación Android en Java utilizada por los camareros para crear los pedidos de la gente que come en el restaurante.</li> </ul> <p>Toda la aplicación Android fue hecha por mí, y la puedes encontrar aquí: <a href=\"https://github.com/ericbargim/GestMans\" target=\"_blank\"><b>GestMans</b></a>. La nota del proyecto fue 10.<br><br>Este fue mi mejor año como estudiante (y probablemente el que más disfruté) con una nota final de <b>~9.7</b>.<br/><br/>La nota final del ciclo de DAM fue <b>9.32</b>.</p>",
    "fourth-title": "CFGS - 2º Administración de redes y sistemas",
    "fourth-dates": "Septiembre 2020 - Junio 2021",
    "fourth-content": "<p>Como el primer año de DAM fue una mezcla de DAM y ASIX, ya me quedó 1º ASIX aprobado, y por lo tanto podía hacer 2º ASIX justo después de 2º DAM. Durante este año estudié: </p> <ul> <li>Administación de base de datos.</li> <li>Utilidades informáticas.</li> <li>Planificación y administración de redes.</li> <li>Administración de servidores Windows y Linux.</li> <li>Implementación de aplicaciones web (PHP básico).</li> <li>Seguridad y Alta Disponibilidad.</li> </ul> <p>Este año también tuvimos que hacer un proyecto final de curso, y decidimos ampliar el proyecto del año pasado creando toda la infraestructura necesaria para desplegar nuestro conjunto de aplicaciones en un restaurante. Este proyecto contenía:</p> <ul> <li>El diseño de nuestra oficinas centrales y 2 restaurantes.</li> <li>Una infraestructura de red simulada recreando una real.</li> <li>De nuevo, la BBDD estaba almacenada en Amazon AWS (Amazon RDS).</li> <li>Un servidor Linux como servidor Apache para almacenar nuestra página web.</li> <li>Un servidor Windows como RRAS (Simulando un Router).</li> <li>Otro servidor Windows administrando un Directorio Activo y un DNS.</li> <li>Otro servidor Windows con un Directorio Activo y un DNS para asegurar una Alta disponibilidad.</li> <li>Un NAS para alacenar las actualizaciones de las aplicaciones de escritorio y móvil.</li> <li>Una VPN para poderse conectar al NAS.</li> <li>Un sistema de copias con discos duros en RAID.</li> </ul> <p>Todas las aplicaciones del año pasado fueron actualizadas para asegurar una compatibilidad completa. Todo el equipo trabajó de manera conjunta en todas las tareas, así que ningún rol fue asignado a nadie. Nuestra nota de proyecto fue 10.<br/><br/>También difruté mucho este año, pero no tanto como los dos años de DAM. Eché mucho en falta los momentos mientras programas de pensar como implementar una nueva característica, de luchar en solucionar un <i>bug</i>, etc.<br/><br/>Mi nota final del ciclo de ASIX fue <b>9.1</b>.</p>",
    "fifth-title": "Por mi cuenta",
    "fifth-dates": "Junio 2021 - Octubre 2022",
    "fifth-content": "<p>Desde que acabé <i>2º ASIX</i> he estado estudiando Android por mi cuenta, de manera 100% autodidacta, ya que es mi lenguaje / plataforma favorito desdé que lo empecé a estudiar en <i>2º DAM</i>.<br/><br/>Primero resumí un proyecto qeu creé cuando estaba en <i>2º ASIX</i>, una aplicación llamada <a href=\"https://github.com/AdverseGecko3/CryptOficatioN\" target=\"_blank\">CryptOficatioN</a>. Al principio era una aplicación mostrando las criptomonedas más populares, con un RecyclerView simple y poco más, pero después empecé a añadir cosas como:</p> <ul> <li>Un sistema de filtros de la información mostrada en el RecyclerView.</li> <li>Una Splash Screen (De la manera antigua, con un Activity dedicado a ello).</li> <li>SwipeRefreshLayout para refrescar la información deslizando hacia abajo.</li> <li>Uso de Glide / Picasso para cargar imágenes via URL y guardarlas en caché.</li> <li>Ordenar la lista por diferentes parámetros como Market Cap, Nombre, Símbolo o Precio.</li> <li>SharedPreferences para guardar la configuración como el ordenado por defecto, la moneda por defecto o la cantidad de items por página.</li> <li>ItemTouchHelper para deslizar un item de una lista y realizar una acción.</li> <li>Modo Claro / Oscuro.</li> </ul> <p>Después de hacer todo esto, migré la aplicación a Kotlin ya que era (y es) el lenguaje con soporte prioritario por Google, y quería dejar de lado Java y empezar a aprender Kotlin. Empecé el proyecto <a href=\"https://github.com/AdverseGecko3/CryptOficatioN_kotlin\" target=\"_blank\">CryptOficatioN_kotlin</a>. En él modifiqué algunos cosas del proyecto \"antiguo\" y empecé a empezar nuevas cosas como:</p> <ul> <li>Cambié de HTTP Request a Retrofit2.</li> <li>Añadí una arquitectura MVVM y LiveData.</li> <li>ViewBinding para trabajar más facilmente con los vistas.</li> <li>Cambié el SplashScreen por el método de Layer-List.</li> <li>Extensiones para evitar repetir código.</li> <li>Migré la Base de Datos de SQLite a Room.</li> <li>Uso de corrutinas.</li> <li>Cambié la navegación por Navigation Controller, para navegar más fácilmente entre Fragments / Diálogos.</li> <li>Implementación de <a href=\"https://github.com/PhilJay/MPAndroidChart\" target=\"_blank\">MPAndroidChart</a> para mostrar gráficos.</li> <li>Enviar notificaciones y poder hacerlo diáriamente a una hora en específico.</li> <li>Implementación de Google AdMob.</li> <li>Android Hilt para inyección de dependencias.</li> <li>Implementación de Firebase y Crashlytics.</li> </ul>"
  },
  "academic-titles": {
    "title": "Títulos académicos",
    "content": "<p>Durante mis 3 años estudiando asignaturas relacionadas con la informática he conseguido estos títulos:</p> <ul> <li>MTA Software Developer Fundamentals.</li> <li>MTA Windows Server Administration Fundamentals.</li> <li>MTA Security Fundamentals.</li> <li>Certificado de Administración de Windows 10.</li> <li>Certificado de Java SE Programming Language and Fundamentals.</li> <li>Certificado de Programación y desarrollo de aplicaciones en Android.</li> </ul>"
  },
  "job-timeline": {
    "title": "Trayectoria laboral",
    "first-title": "Android Tester en Accenture",
    "first-dates": "Febrero 2020 - Marzo 2020",
    "first-content": "<p>Este fue mi trabajo en prácticas de 2º DAM. Trabajé en la consultora Accenture, específicamente para Zurich, en una aplicación de seguros. Hice Testing UI en Appium, asegurando que el <i>flow</i> de la app estaba funcionando como se deseaba.<br/><br/>Este trabajo debería haberse acabado a finales de Mayo, pero a causa del COVID-19 se acabó antes de lo esperado.",
    "second-title": "Administrador IT en Tekman Education",
    "second-dates": "Octubre 2020 - Marzo 2021",
    "second-content": "<p>Empecé haciendo tareas básicas como instalar aplicaciones en los portátiles de los empleados, instalando cables, etc. Pero pocas semanas después y viendo que lo estaba haciendo bien, el CEO decidió darme algunas tareas más. Empecé a preparar todos los portátiles cuando alguien se marchaba de la empresa o cuando alguien nuevo entraba, y más tarde me encargué de todas las incidencias relacionadas con la informática, cualquier necesidad de actualización y asegurando el correcto funcionamiento de todos los dispositivos electrónicos.",
    "third-title": "Junior Delivery Analyst en Deloitte",
    "third-dates": "Diciembre 2022 - Presente",
    "third-content": "<p>Deloitte estaba buscando un perfil Junior para el departamento de Risk Advisory, específicamente un Analista de Datos para el sector Risk Advisory.</p>"
  }
}
